{
  "Legendary Tier (~1%)": {
    "description": "Godlike clans with world-shaking potential. If you roll this, you're living a myth. Tread carefully—your story will be legendary, or tragic.",
    "clans": {
      "Sekkan": "Wielders of Particle Release, able to disintegrate matter on a molecular level. Their power is absolute—and terrifying.",
      "Shinkan": "Masters of gravity. Battlefield architects who can crush, levitate, or control the terrain itself with a thought.",
      "Uchiha": "The iconic flame of tragedy and genius. Sharingan, Mangekyō, and the curse of deep emotion make them powerful and unstable.",
      "Namikaze": "Masters of space and time, famed for their godlike speed and instantaneous teleportation. Fleeting legends whose mere presence alters fate—blink, and they're already gone.",
      "Chinoike": "Blood manipulators wielding the sinister Ketsuryūgan. They turn veins into weapons, controlling blood and senses alike. Feared as cursed demons—whose crimson gaze brings madness or death."
    }
  },
  "Epic Tier (~5%)": {
    "description": "Rare, elite, or prestigious clans. Their names echo in history, and their powers shape the battlefield.",
    "clans": {
      "Senju": "Founders of Konoha, Wood Release legends, and chakra titans. Versatile, spiritual, and revered.",
      "Shumyakuro": "Atmospheric manipulators who twist perception and pressure. Reality warps around them.",
      "Raiketsu": "Living lightning circuits with nerve-crushing touch. Ultra-fast, ultra-deadly, ultra-short-lived.",
      "Yuki": "Ice Release elegance and battlefield lockdown. Snipers, skaters, and silent killers.",
      "Kurama": "Genjutsu prodigies whose illusions can break minds—and sometimes bodies. Beautiful, horrifying, and rare.",
      "Terumī": "Lava-wielders of molten power. Tactical, explosive, and politically cunning.",
      "Hōzuki": "Water-bodied assassins who can melt through cracks, blades, and your last hope.",
      "Uzumaki": "Seal masters with monstrous stamina. Born to contain tailed beasts, protect villages, and endure anything."
    }
  },
  "Rare Tier (~15%)": {
    "description": "Clans with deadly specialties, powerful niches, or explosive potential. You're not common, but you're still watched.",
    "clans": {
      "Hyūga": "All-seeing eyes and chakra-destroying fists. The guardians of Konoha’s legacy and internal order.",
      "Enraikō": "Flashfire blitzers who blind and burn in a heartbeat. If you see them, it’s already too late.",
      "Yotsuki": "Lightning-wrapped brawlers descended from Raikage. Strength, speed, and swagger.",
      "Kaguya": "Bone-breaking berserkers with savage instincts and tragic fates. Unkillable, but unstable.",
      "Gansho": "Explosion release maniacs who leave craters and silence behind. Live loud, die louder.",
      "En’yō": "Boil mist tacticians. Slow, creeping death wrapped in a calm mask.",
      "Kozame": "Crystal release artists who trap, slice, and sculpt the battlefield into a graveyard.",
      "Soragane": "Sound engineers and comm-saboteurs. You don’t see them—but they hear everything.",
      "Tsuyugiri": "Mist puppeteers who animate corpses. The dead don’t stay down when they’re near."
    }
  },
  "Standard Tier (~79%)": {
    "description": "These clans are the shinobi foundation. You may not be flashy—but you're clever, reliable, and still dangerous as hell. Your rise is yours to earn.",
    "clans": {
      "Nara": "Shadow tacticians who win before the first kunai flies. Lazy brilliance is still brilliance.",
      "Yamanaka": "Mental invaders and battlefield communicators. They see into minds and turn them inside out.",
      "Aburame": "Bug hosts with cold precision. If the swarm is moving… someone’s already losing.",
      "Akimichi": "Giants with warm hearts and terrifying fists. Butterfly mode turns snacks into shockwaves.",
      "Sarutobi": "Ash-bending veterans with fire, wisdom, and summoning beasts. The Will of Fire smolders.",
      "Kamizuru": "Chakra bee handlers who sting, swarm, and sabotage. Don't underestimate the hive.",
      "Inuzuka": "Wild trackers with loyal ninken. They fight as a pack—and they never lose the scent."
    }
  }
}